# EditScope Properties

---
The EditScope type exposes the following members.
| Name| Description
---|---|---
| IsActive|  Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
| IsPermitted|  Tells if the edit scope is permitted to start.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
EditScope Class
Autodesk.Revit.DB Namespace